# vim: syntax=ruby filetype=ruby
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'

# System tools
brew 'gettext', args: ['force-bottle']
brew 'proctools', args: ['force-bottle']
brew 'pstree', args: ['force-bottle']
brew 'coreutils', args: ['force-bottle']
brew 'findutils', args: ['force-bottle']
brew 'htop', args: ['force-bottle']
brew 'gnu-tar', args: ['force-bottle']
brew 'gnu-which', args: ['force-bottle']
brew 'gnu-sed', args: ['force-bottle']
brew 'gnu-indent', args: ['force-bottle']
brew 'grep', args: ['force-bottle']
brew 'gawk', args: ['force-bottle']
brew 'gnutls', args: ['force-bottle']
brew 'gnu-getopt', args: ['force-bottle']
brew 'parallel', args: ['force-bottle']
brew 'screen', args: ['force-bottle']
brew 'ncurses', args: ['force-bottle']
brew 'pv', args: ['force-bottle']
brew 'unrar', args: ['force-bottle']

# Development & Power Tools
cask 'iterm2'
cask 'visual-studio-code'
brew 'bash', args: ['force-bottle']
brew 'bash-completion', args: ['force-bottle']
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'ack', args: ['force-bottle']
brew 'ccat', args: ['force-bottle']
brew 'icdiff'
brew 'diff-so-fancy', args: ['force-bottle']
brew 'git' # no force-bottle: git --exec-path doesn't work, remote helpers missing from path
brew 'gti', args: ['force-bottle']
brew 'go', args: ['force-bottle']
brew 'fzf', args: ['force-bottle']
brew 'grv', args: ['force-bottle']
brew 'hub', args: ['force-bottle']
brew 'jq', args: ['force-bottle']
brew 'node', args: ['force-bottle']
brew 'rust', args: ['force-bottle']
brew 'ruby', args: ['force-bottle']
brew 'python2', args: ['force-bottle']
brew 'python3', args: ['force-bottle']
brew 'openssl', args: ['force-bottle']
brew 'openssh', args: ['force-bottle']
brew 'protobuf', args: ['force-bottle']
brew 'prototool', args: ['force-bottle']
brew 'the_silver_searcher', args: ['force-bottle']
brew 'ripgrep', args: ['force-bottle']
brew 'tree', args: ['force-bottle']
brew 'wget', args: ['force-bottle']
cask 'google-cloud-sdk'
brew 'watch', args: ['force-bottle']
brew 'fd', args: ['force-bottle']
brew 'ncdu', args: ['force-bottle']
brew 'wdiff', args: ['force-bottle']
brew 'entr', args: ['force-bottle']
brew 'bats', args: ['force-bottle']
brew 'tldr', args: ['force-bottle']
brew 'hugo', args: ['force-bottle']
brew 'shellcheck', args: ['force-bottle']
brew 'telnet', args: ['force-bottle']
brew 'mitmproxy', args: ['force-bottle']
brew 'fortio', args: ['force-bottle']

# Commit signing
brew 'pinentry-mac', args: ['force-bottle']
brew 'gnupg', args: ['force-bottle']
cask 'keybase'

# Containers
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'kubectx', args: ['force-bottle']
brew 'kube-ps1', args: ['force-bottle']
cask 'minikube'
brew 'docker-machine-driver-xhyve', args: ['force-bottle']
brew 'skaffold', args: ['force-bottle']
brew 'kustomize', args: ['force-bottle']
brew 'cfssl', args: ['force-bottle']
cask 'docker' # docker for desktop

# Fun tools
brew 'asciinema', args: ['force-bottle']
brew 'lolcat', args: ['force-bottle']

# kubernetes dev
brew 'hg', args: ['force-bottle']
brew 'etcd', args: ['force-bottle']

# Desktop Software
cask 'clipy'
cask 'recordit'
cask 'zoomus'
cask 'flux'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask '1password'
cask 'dropbox'
cask 'google-chrome'
cask 'coconutbattery'
cask 'firefox'
