# vim: syntax=ruby filetype=ruby
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'ldez/tap'
tap 'buildpack/tap'

# System tools
brew 'gettext'
brew 'proctools'
brew 'pstree'
brew 'coreutils'
brew 'findutils'
brew 'htop'
brew 'gnu-tar'
brew 'gnu-time'
brew 'gnu-which'
brew 'gnu-sed'
brew 'gnu-indent'
brew 'grep'
brew 'less'
brew 'gawk'
brew 'gnutls'
brew 'gnu-getopt'
brew 'parallel'
brew 'screen'
brew 'ncurses'
brew 'pv'
brew 'shfmt'
brew 'ncdu'
brew 'dust'
brew 'z'

# Development & Power Tools
cask 'iterm2'
cask 'visual-studio-code'
cask 'goland'
brew 'bash'
brew 'bash-completion'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'ack'
brew 'ccat'
brew 'bat'
brew 'icdiff'
brew 'colordiff'
brew 'diff-so-fancy'
brew 'git' # no force-bottle: git --exec-path doesn't work, remote helpers missing from path
brew 'hg'
brew 'interactive-rebase-tool'
brew 'gti'
brew 'prm'
brew 'go'
brew 'fzf'
brew 'grv'
brew 'jq'
brew 'node'
brew 'rust'
brew 'ruby'
brew 'python3'
brew 'openssl'
brew 'openssh'
brew 'protobuf'
brew 'prototool'
brew 'dog'
brew 'the_silver_searcher'
brew 'ripgrep'
brew 'tree'
brew 'wget'
cask 'google-cloud-sdk'
brew 'watch'
brew 'fd'
brew 'wdiff'
brew 'entr'
brew 'direnv'
brew 'bats'
brew 'tldr'
brew 'hugo'
brew 'shellcheck'
brew 'telnet'
brew 'mitmproxy'
brew 'fortio'

# Commit signing
brew 'pinentry-mac'
brew 'gnupg'
cask 'keybase'

# Containers
brew 'kubernetes-cli'
brew 'helm'
brew 'kubectx'
brew 'kube-ps1'
brew 'minikube'
brew 'kind'
brew 'docker-machine-driver-hyperkit'
brew 'skaffold'
brew 'kustomize'
brew 'cfssl'
cask 'docker' # docker for desktop
brew 'pack'
brew 'ko'
brew 'cosign'

# Fun tools
brew 'asciinema'
brew 'lolcat'


# Desktop Software
cask 'clipy'
cask 'vimac'
cask 'zoomus'
cask 'flux'
cask 'slack'
cask 'rectangle'
cask 'monitorcontrol'
cask 'spotify'
cask '1password'
cask 'dropbox'
cask 'google-chrome'
cask 'coconutbattery'
cask 'firefox'
cask 'open-in-code'
cask 'bitbar'
cask 'discord'
cask 'recordit'

# Hardware support
cask 'karabiner-elements'
brew 'ykman'

# Streaming software
cask 'obs'
cask 'loopback'
cask 'shureplus-motiv'
cask 'gopro-webcam'
cask 'vlc'
