# vim: syntax=ruby filetype=ruby
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'

# System tools
brew 'coreutils'
brew 'proctools'
brew 'findutils', args: ['with-default-names']
brew 'htop', args: ['with-ncurses']
brew 'gnu-tar', args: ['with-default-names']
brew 'gnu-which', args: ['with-default-names']
brew 'gnu-sed', args: ['with-default-names']
brew 'gnu-indent', args: ['with-default-names']
brew 'grep'
brew 'gawk'
brew 'gnutls'
brew 'gnu-getopt'
brew 'parallel'
brew 'screen'
brew 'ncurses'
brew 'pv'
brew 'unrar'

# Development & Power Tools
cask 'iterm2'
brew 'bash'
brew 'bash-completion'
brew 'ack'
brew 'ccat'
brew 'diff-so-fancy'
brew 'git'
brew 'gti' # lol
brew 'go'
brew 'fzf'
brew 'grv'
brew 'hub'
brew 'jq'
brew 'node'
brew 'openssl', args: ['without-tests']
brew 'openssh'
brew 'protobuf'
brew 'prototool'
brew 'pstree'
brew 'the_silver_searcher'
brew 'ripgrep'
brew 'tree'
brew 'python'
brew 'python3'
brew 'vim'
brew 'wget'
cask 'google-cloud-sdk'
brew 'watch'
brew 'fd'
brew 'ncdu'
brew 'wdiff', args: ['with-gettext']
brew 'entr'
brew 'bats'
brew 'tldr'
brew 'hugo'
brew 'shellcheck'
brew 'telnet'
brew 'mitmproxy'

# Commit signing
brew 'pinentry-mac'
brew 'gnupg'
brew 'gpg-agent'
cask 'keybase'

# Containers
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'kubectx' # ❤️
brew 'kube-ps1'
cask 'minikube'
brew 'docker-machine-driver-xhyve'
brew 'skaffold'
brew 'kustomize'
brew 'cfssl'

# Fun tools
brew 'asciinema'
brew 'lolcat'

# kubernetes dev
brew 'hg'
brew 'etcd'

# Desktop Software
cask 'clipy'
cask 'recordit'
cask 'zoomus'
cask 'flux'
cask 'spectacle'
cask 'spotify'
cask '1password'
cask 'dropbox'
cask 'google-chrome'
cask 'coconutbattery'
cask 'firefox'
cask 'intel-power-gadget'
